//     tSF Briefing
// Do not modify this part
#define BRIEFING		_briefing = [];
#define TOPIC(NAME) 	_briefing pushBack ["Diary", [ NAME,
#define END			]];
#define ADD_TOPICS	for "_i" from (count _briefing) to 0 step -1 do {player createDiaryRecord (_briefing select _i);};
#define TAGS tSF_MissionTags = 
//
//
// Mission tags
TAGS(["INFANTRY"]);

// Briefing goes here

BRIEFING

TOPIC("I. Обстановка:")
"8 апреля силы ОМОН и казаков погрузили нас в автобусы, и вывезли из г. Джубга. Хотя утверждают, будто речь идёт просто о выселении перед предстоящими массовыми мероприятиями, наш аналитик Маня Боярка предполагает наше физическое устранение. Нам необходимо перегруппироваться, разделаться с конвоирами и расправиться с угрозой в виде есаула Ряженого и его людей раз и навсегда."
END

TOPIC("А. Враждебные силы:")
"Неизвестное количество казаков в Каменке, Балоте, и ПГТ Черногорск.
<br />Силы ОМОНа в Комарово.
<br />По всей видимости, между ОМОН и казаками вспыхнул конфликт, и мы можем этим воспользоваться."
END

TOPIC("Б. Дружественные силы:")
"Три отделения бомжей: 1'1, 1'2, 1'3."
END

TOPIC("II. Задание:")
"1. Убить есаула Ряженого. Предположительно он находится в церкви.
<br />2. Отступить к Теплоцентрали."
END

TOPIC("III. Выполнение:")
"По плану полковника де Теплоцентраля."
END

TOPIC("IV. Поддержка:")
"Мы располагаем только подручными средствами самозащиты, но Каменка - охотничий посёлок, и здесь наверняка  можно найти оружие и транспорт."
END

TOPIC("V. Сигналы:")
"1'1 - SR CH 1
<br />1'2 - SR CH 2
<br />1'3 - SR CH 3"
END

TOPIC("VI. Замечания:")
"Удар - ЛКМ, блок - ПКМ. Удар ногой и другие опции рекомендуется настроить самостоятельно."
END

if ((serverCommandAvailable '#logout') || !(isMultiplayer) || isServer) then {
TOPIC("VII. Замечания для GSO:")
"### Информация которую увидит только ГСО. Указать какой тактики будет придерживаться враг, какие резервы он имеет и прочие советы по курированию миссии."
END
};

ADD_TOPICS